#### Terraform Validation & Plan Results
* Terraform Version 📎`1.10.2`
* Working Directory 📂`./tests/e2e`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.data_management_zone.module.platform.data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.platform.data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.platform.data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.datamanagement.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_purview.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_purview.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iMzdlMTg1Yy04OWJiLTQ2ZDQtODY3Zi05NmM0NWQwMTYyMDA7b2JqZWN0SWQ9MTYwOWE1NzUtNzA2My00ZjU5LWI2ZjUtYTVlY2IwZDk3MDNjO3N1YnNjcmlwdGlvbklkPTY0ZDk3MDQyLWE4YjUtNDAzMy1iMmQxLTRiYmRhNDBjOGE5MTt0ZW5hbnRJZD05NTg3OGQyZS01ZjEyLTQ4N2YtYjQ1NC1hYTVmZTBkYjEyYTI=][0m
[0m[1mmodule.data_management_zone.module.datamanagement.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iMzdlMTg1Yy04OWJiLTQ2ZDQtODY3Zi05NmM0NWQwMTYyMDA7b2JqZWN0SWQ9MTYwOWE1NzUtNzA2My00ZjU5LWI2ZjUtYTVlY2IwZDk3MDNjO3N1YnNjcmlwdGlvbklkPTY0ZDk3MDQyLWE4YjUtNDAzMy1iMmQxLTRiYmRhNDBjOGE5MTt0ZW5hbnRJZD05NTg3OGQyZS01ZjEyLTQ4N2YtYjQ1NC1hYTVmZTBkYjEyYTI=][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_scim.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.purview_account[0].data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.purview_account[0].data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iMzdlMTg1Yy04OWJiLTQ2ZDQtODY3Zi05NmM0NWQwMTYyMDA7b2JqZWN0SWQ9MTYwOWE1NzUtNzA2My00ZjU5LWI2ZjUtYTVlY2IwZDk3MDNjO3N1YnNjcmlwdGlvbklkPTY0ZDk3MDQyLWE4YjUtNDAzMy1iMmQxLTRiYmRhNDBjOGE5MTt0ZW5hbnRJZD05NTg3OGQyZS01ZjEyLTQ4N2YtYjQ1NC1hYTVmZTBkYjEyYTI=][0m
[0m[1mmodule.data_management_zone.module.datamanagement.module.key_vault_scim.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iMzdlMTg1Yy04OWJiLTQ2ZDQtODY3Zi05NmM0NWQwMTYyMDA7b2JqZWN0SWQ9MTYwOWE1NzUtNzA2My00ZjU5LWI2ZjUtYTVlY2IwZDk3MDNjO3N1YnNjcmlwdGlvbklkPTY0ZDk3MDQyLWE4YjUtNDAzMy1iMmQxLTRiYmRhNDBjOGE5MTt0ZW5hbnRJZD05NTg3OGQyZS01ZjEyLTQ4N2YtYjQ1NC1hYTVmZTBkYjEyYTI=][0m
[0m[1mmodule.data_management_zone.module.platform.data.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/64d97042-a8b5-4033-b2d1-4bbda40c8a91/resourceGroups/chk-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/spoke-chk-dev-vnet001-default-nsg-westus3][0m
[0m[1mmodule.data_management_zone.module.platform.data.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/64d97042-a8b5-4033-b2d1-4bbda40c8a91/resourceGroups/chk-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-chk-dev-vnet001][0m
[0m[1mmodule.data_management_zone.module.platform.data.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/64d97042-a8b5-4033-b2d1-4bbda40c8a91/resourceGroups/chk-dev-networking-rg/providers/Microsoft.Network/routeTables/chk-dev-default-rt001][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.data_management_zone.module.datamanagement.data.azurerm_key_vault_secret.key_vault_secret_databricks_account_scim_token[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_key_vault_secret" "key_vault_secret_databricks_account_scim_token" {
      [32m+[0m[0m content_type            = (known after apply)
      [32m+[0m[0m expiration_date         = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = (known after apply)
      [32m+[0m[0m name                    = "scim-token"
      [32m+[0m[0m not_before_date         = (known after apply)
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m tags                    = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api["westus3"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_databricks_ui_api" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "ckdmgmt-dev-westus3-dbw001-ddctd-uiapi-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "westus3"
      [32m+[0m[0m name                          = "ckdmgmt-dev-westus3-dbw001-ddctd-uiapi-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "ckdmgmt-dev-connectivity-adb-westus3-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "ckdmgmt-dev-westus3-dbw001-arecord"
          [32m+[0m[0m private_dns_zone_ids = (known after apply)
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "ckdmgmt-dev-westus3-dbw001-uiapi-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "databricks_ui_api",
            ]
        }
    }

[1m  # module.data_management_zone.module.datamanagement.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_blob["westus3"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_dbfs_blob" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "ckdmgmt-dev-westus3-dbw001-ddctd-blob-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "westus3"
      [32m+[0m[0m name                          = "ckdmgmt-dev-westus3-dbw001-ddctd-blob-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "ckdmgmt-dev-connectivity-adb-westus3-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "ckdmgmt-dev-westus3-dbw001-arecord"
          [32m+[0m[0m private_dns_zone_ids = (known after apply)
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "ckdmgmt-dev-westus3-dbw001-blob-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "blob",
            ]
        }
    }

[1m  # module.data_management_zone.module.datamanagement.azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_dfs["westus3"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_dbfs_dfs" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "ckdmgmt-dev-westus3-dbw001-ddctd-dfs-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "westus3"
      [32m+[0m[0m name                          = "ckdmgmt-dev-westus3-dbw001-ddctd-dfs-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "ckdmgmt-dev-connectivity-adb-westus3-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "ckdmgmt-dev-westus3-dbw001-arecord"
          [32m+[0m[0m private_dns_zone_ids = (known after apply)
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "ckdmgmt-dev-westus3-dbw001-dfs-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "dfs",
            ]
        }
    }

[1m  # module.data_management_zone.module.datamanagement.azurerm_resource_group.automation_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "automation_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "westus3"
      [32m+[0m[0m name     = "ckdmgmt-dev-automation-rg"
    }

[1m  # module.data_management_zone.module.datamanagement.azurerm_resource_group.connectivity_adb_rg["westus3"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "connectivity_adb_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "westus3"
      [32m+[0m[0m name     = "ckdmgmt-dev-connectivity-adb-westus3-rg"
    }

[1m  # module.data_management_zone.module.datamanagement.azurerm_resource_group.connectivity_synapse_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "connectivity_synapse_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "westus3"
      [32m+[0m[0m name     = "ckdmgmt-dev-connectivity-syn-rg"
    }

[1m  # module.data_management_zone.module.datamanagement.azurerm_resource_group.container_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "container_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "westus3"
      [32m+[0m[0m name     = "ckdmgmt-dev-container-rg"
    }

[1m  # module.data_management_zone.module.datamanagement.azurerm_resource_group.governance_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "governance_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "westus3"
      [32m+[0m[0m name     = "ckdmgmt-dev-governance-rg"
    }

[1m  # module.data_management_zone.module.datamanagement.azurerm_resource_group.scim_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "scim_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "westus3"
      [32m+[0m[0m name     = "ckdmgmt-dev-scim-rg"
    }

[1m  # module.data_management_zone.module.datamanagement.azurerm_role_assignment.purview_roleassignment_key_vault[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "purview_roleassignment_key_vault" {
      [32m+[0m[0m condition_version                = (known after apply)
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Secrets User"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.null_resource.databricks_account_scim_token[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "databricks_account_scim_token" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "execute" = (known after apply)
        }
    }

[1m  # module.data_management_zone.module.datamanagement.null_resource.system_schema["westus3"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "system_schema" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {}
    }

[1m  # module.data_management_zone.module.datamanagement.time_rotating.databricks_account_scim_token_regenerate[0m will be created
[0m  [32m+[0m[0m resource "time_rotating" "databricks_account_scim_token_regenerate" {
      [32m+[0m[0m day              = (known after apply)
      [32m+[0m[0m hour             = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m minute           = (known after apply)
      [32m+[0m[0m month            = (known after apply)
      [32m+[0m[0m rfc3339          = (known after apply)
      [32m+[0m[0m rotation_months  = 12
      [32m+[0m[0m rotation_rfc3339 = (known after apply)
      [32m+[0m[0m second           = (known after apply)
      [32m+[0m[0m unix             = (known after apply)
      [32m+[0m[0m year             = (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.time_sleep.sleep_databricks_workspace["westus3"][0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_databricks_workspace" {
      [32m+[0m[0m create_duration = "30s"
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m triggers        = {
          [32m+[0m[0m "databricks_workspace_completed" = "true"
        }
    }

[1m  # module.data_management_zone.module.platform.azapi_update_resource.virtual_network[0m will be created
[0m  [32m+[0m[0m resource "azapi_update_resource" "virtual_network" {
      [32m+[0m[0m body                    = {
          [32m+[0m[0m properties = {
              [32m+[0m[0m subnets = [
                  [32m+[0m[0m {
                      [32m+[0m[0m name       = "ServicesSubnet"
                      [32m+[0m[0m properties = {
                          [32m+[0m[0m addressPrefix                     = "10.1.0.0/24"
                          [32m+[0m[0m defaultOutboundAccess             = false
                          [32m+[0m[0m delegations                       = []
                          [32m+[0m[0m ipAllocations                     = []
                          [32m+[0m[0m networkSecurityGroup              = {
                              [32m+[0m[0m id = "/subscriptions/64d97042-a8b5-4033-b2d1-4bbda40c8a91/resourceGroups/chk-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/spoke-chk-dev-vnet001-default-nsg-westus3"
                            }
                          [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
                          [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
                          [32m+[0m[0m routeTable                        = {
                              [32m+[0m[0m id = "/subscriptions/64d97042-a8b5-4033-b2d1-4bbda40c8a91/resourceGroups/chk-dev-networking-rg/providers/Microsoft.Network/routeTables/chk-dev-default-rt001"
                            }
                          [32m+[0m[0m serviceEndpointPolicies           = []
                          [32m+[0m[0m serviceEndpoints                  = []
                        }
                    },
                ]
            }
        }
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ignore_casing           = true
      [32m+[0m[0m ignore_missing_property = true
      [32m+[0m[0m locks                   = []
      [32m+[0m[0m name                    = (known after apply)
      [32m+[0m[0m output                  = (known after apply)
      [32m+[0m[0m parent_id               = (known after apply)
      [32m+[0m[0m resource_id             = "/subscriptions/64d97042-a8b5-4033-b2d1-4bbda40c8a91/resourceGroups/chk-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-chk-dev-vnet001"
      [32m+[0m[0m response_export_values  = [
          [32m+[0m[0m "properties.subnets",
        ]
      [32m+[0m[0m type                    = "Microsoft.Network/virtualNetworks@2024-03-01"
    }

[1m  # module.data_management_zone.module.platform.azurerm_network_security_group.network_security_group_databricks["westus3"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_network_security_group" "network_security_group_databricks" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "westus3"
      [32m+[0m[0m name                = "ckdmgmt-dev-westus3-nsg001"
      [32m+[0m[0m resource_group_name = "ckdmgmt-dev-network-databricks-rg"
      [32m+[0m[0m security_rule       = (known after apply)
    }

[1m  # module.data_management_zone.module.platform.azurerm_private_dns_zone.private_dns_zone["blob"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_dns_zone" "private_dns_zone" {
      [32m+[0m[0m id                                                    = (known after apply)
      [32m+[0m[0m max_number_of_record_sets                             = (known after apply)
      [32m+[0m[0m max_number_of_virtual_network_links                   = (known after apply)
      [32m+[0m[0m max_number_of_virtual_network_links_with_registration = (known after apply)
      [32m+[0m[0m name                                                  = "privatelink.blob.core.windows.net"
      [32m+[0m[0m number_of_record_sets                                 = (known after apply)
      [32m+[0m[0m resource_group_name                                   = "ckdmgmt-dev-privatedns-rg"

      [32m+[0m[0m soa_record (known after apply)
    }

[1m  # module.data_management_zone.module.platform.azurerm_private_dns_zone.private_dns_zone["databricks"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_dns_zone" "private_dns_zone" {
      [32m+[0m[0m id                                                    = (known after apply)
      [32m+[0m[0m max_number_of_record_sets                             = (known after apply)
      [32m+[0m[0m max_number_of_virtual_network_links                   = (known after apply)
      [32m+[0m[0m max_number_of_virtual_network_links_with_registration = (known after apply)
      [32m+[0m[0m name                                                  = "privatelink.azuredatabricks.net"
      [32m+[0m[0m number_of_record_sets                                 = (known after apply)
      [32m+[0m[0m resource_group_name                                   = "ckdmgmt-dev-privatedns-rg"

      [32m+[0m[0m soa_record (known after apply)
    }

[1m  # module.data_management_zone.module.platform.azurerm_private_dns_zone.private_dns_zone["dfs"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_dns_zone" "private_dns_zone" {
      [32m+[0m[0m id                                                    = (known after apply)
      [32m+[0m[0m max_number_of_record_sets                             = (known after apply)
      [32m+[0m[0m max_number_of_virtual_network_links                   = (known after apply)
      [32m+[0m[0m max_number_of_virtual_network_links_with_registration = (known after apply)
      [32m+[0m[0m name                                                  = "privatelink.dfs.core.windows.net"
      [32m+[0m[0m number_of_record_sets                                 = (known after apply)
      [32m+[0m[0m resource_group_name                                   = "ckdmgmt-dev-privatedns-rg"

      [32m+[0m[0m soa_record (known after apply)
    }

[1m  # module.data_management_zone.module.platform.azurerm_private_dns_zone_virtual_network_link.private_dns_zone_virtual_network_links["westus3-blob"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_zone_virtual_network_links" {
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m name                  = "westus3-blob"
      [32m+[0m[0m private_dns_zone_name = "privatelink.blob.core.windows.net"
      [32m+[0m[0m registration_enabled  = false
      [32m+[0m[0m resource_group_name   = "ckdmgmt-dev-privatedns-rg"
      [32m+[0m[0m virtual_network_id    = (known after apply)
    }

[1m  # module.data_management_zone.module.platform.azurerm_private_dns_zone_virtual_network_link.private_dns_zone_virtual_network_links["westus3-databricks"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_zone_virtual_network_links" {
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m name                  = "westus3-databricks"
      [32m+[0m[0m private_dns_zone_name = "privatelink.azuredatabricks.net"
      [32m+[0m[0m registration_enabled  = false
      [32m+[0m[0m resource_group_name   = "ckdmgmt-dev-privatedns-rg"
      [32m+[0m[0m virtual_network_id    = (known after apply)
    }

[1m  # module.data_management_zone.module.platform.azurerm_private_dns_zone_virtual_network_link.private_dns_zone_virtual_network_links["westus3-dfs"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_zone_virtual_network_links" {
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m name                  = "westus3-dfs"
      [32m+[0m[0m private_dns_zone_name = "privatelink.dfs.core.windows.net"
      [32m+[0m[0m registration_enabled  = false
      [32m+[0m[0m resource_group_name   = "ckdmgmt-dev-privatedns-rg"
      [32m+[0m[0m virtual_network_id    = (known after apply)
    }

[1m  # module.data_management_zone.module.platform.azurerm_resource_group.resource_group_network_databricks[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "resource_group_network_databricks" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "westus3"
      [32m+[0m[0m name     = "ckdmgmt-dev-network-databricks-rg"
    }

[1m  # module.data_management_zone.module.platform.azurerm_resource_group.resource_group_private_dns[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "resource_group_private_dns" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "westus3"
      [32m+[0m[0m name     = "ckdmgmt-dev-privatedns-rg"
    }

[1m  # module.data_management_zone.module.platform.azurerm_route_table.route_table_databricks["westus3"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_route_table" "route_table_databricks" {
      [32m+[0m[0m bgp_route_propagation_enabled = false
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "westus3"
      [32m+[0m[0m name                          = "ckdmgmt-dev-westus3-rt001"
      [32m+[0m[0m resource_group_name           = "ckdmgmt-dev-network-databricks-rg"
      [32m+[0m[0m route                         = []
      [32m+[0m[0m subnets                       = (known after apply)
    }

[1m  # module.data_management_zone.module.platform.azurerm_virtual_network.virtual_network_databricks["westus3"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_virtual_network" "virtual_network_databricks" {
      [32m+[0m[0m address_space       = [
          [32m+[0m[0m "10.0.0.0/20",
        ]
      [32m+[0m[0m dns_servers         = []
      [32m+[0m[0m guid                = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "westus3"
      [32m+[0m[0m name                = "ckdmgmt-dev-westus3-vnet001"
      [32m+[0m[0m resource_group_name = "ckdmgmt-dev-network-databricks-rg"
      [32m+[0m[0m subnet              = [
          [32m+[0m[0m {
              [32m+[0m[0m address_prefixes                              = [
                  [32m+[0m[0m "10.0.0.0/26",
                ]
              [32m+[0m[0m default_outbound_access_enabled               = true
              [32m+[0m[0m delegation                                    = [
                  [32m+[0m[0m {
                      [32m+[0m[0m name               = "DatabricksDelegation"
                      [32m+[0m[0m service_delegation = [
                          [32m+[0m[0m {
                              [32m+[0m[0m actions = [
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [32m+[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [32m+[0m[0m id                                            = (known after apply)
              [32m+[0m[0m name                                          = "DatabricksPrivateSubnet"
              [32m+[0m[0m private_endpoint_network_policies             = "Enabled"
              [32m+[0m[0m private_link_service_network_policies_enabled = true
              [32m+[0m[0m route_table_id                                = (known after apply)
              [32m+[0m[0m security_group                                = (known after apply)
              [32m+[0m[0m service_endpoint_policy_ids                   = []
              [32m+[0m[0m service_endpoints                             = []
            },
          [32m+[0m[0m {
              [32m+[0m[0m address_prefixes                              = [
                  [32m+[0m[0m "10.0.0.128/26",
                ]
              [32m+[0m[0m default_outbound_access_enabled               = true
              [32m+[0m[0m delegation                                    = []
              [32m+[0m[0m id                                            = (known after apply)
              [32m+[0m[0m name                                          = "PrivateEndpointSubnet"
              [32m+[0m[0m private_endpoint_network_policies             = "Enabled"
              [32m+[0m[0m private_link_service_network_policies_enabled = true
              [32m+[0m[0m route_table_id                                = (known after apply)
              [32m+[0m[0m security_group                                = (known after apply)
              [32m+[0m[0m service_endpoint_policy_ids                   = []
              [32m+[0m[0m service_endpoints                             = []
            },
          [32m+[0m[0m {
              [32m+[0m[0m address_prefixes                              = [
                  [32m+[0m[0m "10.0.0.64/26",
                ]
              [32m+[0m[0m default_outbound_access_enabled               = true
              [32m+[0m[0m delegation                                    = [
                  [32m+[0m[0m {
                      [32m+[0m[0m name               = "DatabricksDelegation"
                      [32m+[0m[0m service_delegation = [
                          [32m+[0m[0m {
                              [32m+[0m[0m actions = [
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [32m+[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [32m+[0m[0m id                                            = (known after apply)
              [32m+[0m[0m name                                          = "DatabricksPublicSubnet"
              [32m+[0m[0m private_endpoint_network_policies             = "Enabled"
              [32m+[0m[0m private_link_service_network_policies_enabled = true
              [32m+[0m[0m route_table_id                                = (known after apply)
              [32m+[0m[0m security_group                                = (known after apply)
              [32m+[0m[0m service_endpoint_policy_ids                   = []
              [32m+[0m[0m service_endpoints                             = []
            },
        ]
    }

[1m  # module.data_management_zone.module.datamanagement.module.container_registry.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_registry[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_container_registry" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.container_registry.azurerm_container_registry.container_registry[0m will be created
[0m  [32m+[0m[0m resource "azurerm_container_registry" "container_registry" {
      [32m+[0m[0m admin_enabled                 = false
      [32m+[0m[0m admin_password                = (sensitive value)
      [32m+[0m[0m admin_username                = (known after apply)
      [32m+[0m[0m anonymous_pull_enabled        = false
      [32m+[0m[0m data_endpoint_enabled         = false
      [32m+[0m[0m encryption                    = (known after apply)
      [32m+[0m[0m export_policy_enabled         = false
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "westus3"
      [32m+[0m[0m login_server                  = (known after apply)
      [32m+[0m[0m name                          = "ckdmgmtdevacr001"
      [32m+[0m[0m network_rule_bypass_option    = "AzureServices"
      [32m+[0m[0m network_rule_set              = [
          [32m+[0m[0m {
              [32m+[0m[0m default_action = "Deny"
            },
        ]
      [32m+[0m[0m public_network_access_enabled = false
      [32m+[0m[0m quarantine_policy_enabled     = false
      [32m+[0m[0m resource_group_name           = "ckdmgmt-dev-container-rg"
      [32m+[0m[0m retention_policy_in_days      = 7
      [32m+[0m[0m sku                           = "Premium"
      [32m+[0m[0m trust_policy_enabled          = false
      [32m+[0m[0m zone_redundancy_enabled       = false

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.container_registry.azurerm_monitor_diagnostic_setting.diagnostic_setting_container_registry["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_container_registry" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/64d97042-a8b5-4033-b2d1-4bbda40c8a91/resourceGroups/chk-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/chk-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.container_registry.azurerm_private_endpoint.container_registry_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "container_registry_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "ckdmgmtdevacr001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "westus3"
      [32m+[0m[0m name                          = "ckdmgmtdevacr001-registry-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "ckdmgmt-dev-container-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "ckdmgmtdevacr001-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "registry",
            ]
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.container_registry.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "30s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_access_connector["westus3"].azurerm_databricks_access_connector.databricks_access_connector[0m will be created
[0m  [32m+[0m[0m resource "azurerm_databricks_access_connector" "databricks_access_connector" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "westus3"
      [32m+[0m[0m name                = "ckdmgmt-dev-westus3-dbac001"
      [32m+[0m[0m resource_group_name = "ckdmgmt-dev-connectivity-adb-westus3-rg"

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["westus3"].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_databricks_workspace" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["westus3"].azurerm_databricks_workspace.databricks_workspace[0m will be created
[0m  [32m+[0m[0m resource "azurerm_databricks_workspace" "databricks_workspace" {
      [32m+[0m[0m access_connector_id                   = (known after apply)
      [32m+[0m[0m customer_managed_key_enabled          = false
      [32m+[0m[0m default_storage_firewall_enabled      = true
      [32m+[0m[0m disk_encryption_set_id                = (known after apply)
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m infrastructure_encryption_enabled     = true
      [32m+[0m[0m location                              = "westus3"
      [32m+[0m[0m managed_disk_identity                 = (known after apply)
      [32m+[0m[0m managed_resource_group_id             = (known after apply)
      [32m+[0m[0m managed_resource_group_name           = "ckdmgmt-dev-westus3-dbw001-rg"
      [32m+[0m[0m name                                  = "ckdmgmt-dev-westus3-dbw001"
      [32m+[0m[0m network_security_group_rules_required = "NoAzureDatabricksRules"
      [32m+[0m[0m public_network_access_enabled         = false
      [32m+[0m[0m resource_group_name                   = "ckdmgmt-dev-connectivity-adb-westus3-rg"
      [32m+[0m[0m sku                                   = "premium"
      [32m+[0m[0m storage_account_identity              = (known after apply)
      [32m+[0m[0m workspace_id                          = (known after apply)
      [32m+[0m[0m workspace_url                         = (known after apply)

      [32m+[0m[0m custom_parameters {
          [32m+[0m[0m nat_gateway_name                                     = (known after apply)
          [32m+[0m[0m no_public_ip                                         = true
          [32m+[0m[0m private_subnet_name                                  = "DatabricksPrivateSubnet"
          [32m+[0m[0m private_subnet_network_security_group_association_id = (known after apply)
          [32m+[0m[0m public_ip_name                                       = (known after apply)
          [32m+[0m[0m public_subnet_name                                   = "DatabricksPublicSubnet"
          [32m+[0m[0m public_subnet_network_security_group_association_id  = (known after apply)
          [32m+[0m[0m storage_account_name                                 = (known after apply)
          [32m+[0m[0m storage_account_sku_name                             = "Standard_LRS"
          [32m+[0m[0m virtual_network_id                                   = (known after apply)
          [32m+[0m[0m vnet_address_prefix                                  = (known after apply)
        }

      [32m+[0m[0m enhanced_security_compliance {
          [32m+[0m[0m automatic_cluster_update_enabled     = true
          [32m+[0m[0m compliance_security_profile_enabled  = true
          [32m+[0m[0m enhanced_security_monitoring_enabled = true
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["westus3"].azurerm_monitor_diagnostic_setting.diagnostic_setting_databricks_workspace["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_databricks_workspace" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/64d97042-a8b5-4033-b2d1-4bbda40c8a91/resourceGroups/chk-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/chk-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["westus3"].azurerm_private_endpoint.private_endpoint_databricks_workspace_browser_authentication[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_browser_authentication" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "ckdmgmt-dev-westus3-dbw001-auth-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "westus3"
      [32m+[0m[0m name                          = "ckdmgmt-dev-westus3-dbw001-auth-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "ckdmgmt-dev-connectivity-adb-westus3-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "ckdmgmt-dev-westus3-dbw001-auth-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "browser_authentication",
            ]
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["westus3"].azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_databricks_ui_api" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "ckdmgmt-dev-westus3-dbw001-uiapi-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "westus3"
      [32m+[0m[0m name                          = "ckdmgmt-dev-westus3-dbw001-uiapi-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "ckdmgmt-dev-connectivity-adb-westus3-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "ckdmgmt-dev-westus3-dbw001-uiapi-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "databricks_ui_api",
            ]
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["westus3"].azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_blob[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_dbfs_blob" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "ckdmgmt-dev-westus3-dbw001-blob-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "westus3"
      [32m+[0m[0m name                          = "ckdmgmt-dev-westus3-dbw001-blob-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "ckdmgmt-dev-connectivity-adb-westus3-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "ckdmgmt-dev-westus3-dbw001-blob-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "blob",
            ]
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["westus3"].azurerm_private_endpoint.private_endpoint_databricks_workspace_dbfs_dfs[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_dbfs_dfs" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "ckdmgmt-dev-westus3-dbw001-dfs-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "westus3"
      [32m+[0m[0m name                          = "ckdmgmt-dev-westus3-dbw001-dfs-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "ckdmgmt-dev-connectivity-adb-westus3-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "ckdmgmt-dev-westus3-dbw001-dfs-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "dfs",
            ]
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.databricks_workspace["westus3"].time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "30s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.key_vault_purview.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.key_vault_purview.azurerm_key_vault.key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault" "key_vault" {
      [32m+[0m[0m access_policy                   = []
      [32m+[0m[0m enable_rbac_authorization       = true
      [32m+[0m[0m enabled_for_deployment          = false
      [32m+[0m[0m enabled_for_disk_encryption     = false
      [32m+[0m[0m enabled_for_template_deployment = false
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m location                        = "westus3"
      [32m+[0m[0m name                            = "ckdmgmt-dev-kv001"
      [32m+[0m[0m public_network_access_enabled   = false
      [32m+[0m[0m purge_protection_enabled        = true
      [32m+[0m[0m resource_group_name             = "ckdmgmt-dev-governance-rg"
      [32m+[0m[0m sku_name                        = "standard"
      [32m+[0m[0m soft_delete_retention_days      = 7
      [32m+[0m[0m tenant_id                       = "95878d2e-5f12-487f-b454-aa5fe0db12a2"
      [32m+[0m[0m vault_uri                       = (known after apply)

      [32m+[0m[0m contact (known after apply)

      [32m+[0m[0m network_acls {
          [32m+[0m[0m bypass         = "AzureServices"
          [32m+[0m[0m default_action = "Deny"
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.key_vault_purview.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_key_vault" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/64d97042-a8b5-4033-b2d1-4bbda40c8a91/resourceGroups/chk-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/chk-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.key_vault_purview.azurerm_private_endpoint.private_endpoint_cognitive_account_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_cognitive_account_vault" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "ckdmgmt-dev-kv001-vault-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "westus3"
      [32m+[0m[0m name                          = "ckdmgmt-dev-kv001-vault-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "ckdmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "ckdmgmt-dev-kv001-vault-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "vault",
            ]
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.key_vault_purview.azurerm_role_assignment.current_roleassignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "current_roleassignment_key_vault" {
      [32m+[0m[0m condition_version                = (known after apply)
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "1609a575-7063-4f59-b6f5-a5ecb0d9703c"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Administrator"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.key_vault_purview.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "30s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.key_vault_scim.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.key_vault_scim.azurerm_key_vault.key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault" "key_vault" {
      [32m+[0m[0m access_policy                   = []
      [32m+[0m[0m enable_rbac_authorization       = true
      [32m+[0m[0m enabled_for_deployment          = false
      [32m+[0m[0m enabled_for_disk_encryption     = false
      [32m+[0m[0m enabled_for_template_deployment = false
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m location                        = "westus3"
      [32m+[0m[0m name                            = "ckdmgmt-dev-kv002"
      [32m+[0m[0m public_network_access_enabled   = false
      [32m+[0m[0m purge_protection_enabled        = true
      [32m+[0m[0m resource_group_name             = "ckdmgmt-dev-scim-rg"
      [32m+[0m[0m sku_name                        = "standard"
      [32m+[0m[0m soft_delete_retention_days      = 7
      [32m+[0m[0m tenant_id                       = "95878d2e-5f12-487f-b454-aa5fe0db12a2"
      [32m+[0m[0m vault_uri                       = (known after apply)

      [32m+[0m[0m contact (known after apply)

      [32m+[0m[0m network_acls {
          [32m+[0m[0m bypass         = "AzureServices"
          [32m+[0m[0m default_action = "Deny"
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.key_vault_scim.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_key_vault" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/64d97042-a8b5-4033-b2d1-4bbda40c8a91/resourceGroups/chk-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/chk-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.key_vault_scim.azurerm_private_endpoint.private_endpoint_cognitive_account_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_cognitive_account_vault" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "ckdmgmt-dev-kv002-vault-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "westus3"
      [32m+[0m[0m name                          = "ckdmgmt-dev-kv002-vault-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "ckdmgmt-dev-scim-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "ckdmgmt-dev-kv002-vault-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "vault",
            ]
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.key_vault_scim.azurerm_role_assignment.current_roleassignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "current_roleassignment_key_vault" {
      [32m+[0m[0m condition_version                = (known after apply)
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "1609a575-7063-4f59-b6f5-a5ecb0d9703c"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Administrator"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.key_vault_scim.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "30s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.purview_account[0].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_purview_account[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_purview_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.purview_account[0].azapi_resource.purview_account[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "purview_account" {
      [32m+[0m[0m body                      = {
          [32m+[0m[0m properties = {
              [32m+[0m[0m ingestionStorage                    = {
                  [32m+[0m[0m publicNetworkAccess = "Disabled"
                }
              [32m+[0m[0m managedEventHubState                = "Disabled"
              [32m+[0m[0m managedResourceGroupName            = "ckdmgmt-dev-pview001-rg"
              [32m+[0m[0m managedResourcesPublicNetworkAccess = "Disabled"
              [32m+[0m[0m publicNetworkAccess                 = "Enabled"
              [32m+[0m[0m tenantEndpointState                 = "Enabled"
            }
          [32m+[0m[0m sku        = {
              [32m+[0m[0m capacity = 1
              [32m+[0m[0m name     = "Standard"
            }
        }
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = "westus3"
      [32m+[0m[0m locks                     = []
      [32m+[0m[0m name                      = "ckdmgmt-dev-pview001"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/64d97042-a8b5-4033-b2d1-4bbda40c8a91/resourceGroups/ckdmgmt-dev-governance-rg"
      [32m+[0m[0m response_export_values    = [
          [32m+[0m[0m "*",
        ]
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = {}
      [32m+[0m[0m type                      = "Microsoft.Purview/accounts@2024-04-01-preview"

      [32m+[0m[0m identity {
          [32m+[0m[0m identity_ids = []
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.purview_account[0].azurerm_monitor_diagnostic_setting.diagnostic_setting_purview_account["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_purview_account" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/64d97042-a8b5-4033-b2d1-4bbda40c8a91/resourceGroups/chk-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/chk-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.purview_account[0].azurerm_private_endpoint.private_endpoint_purview_account_ingestion_storage_blob[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_purview_account_ingestion_storage_blob" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "ckdmgmt-dev-pview001-ing-blob-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "westus3"
      [32m+[0m[0m name                          = "ckdmgmt-dev-pview001-ing-blob-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "ckdmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = true
          [32m+[0m[0m name                           = "ckdmgmt-dev-pview001-ing-blob-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m request_message                = "Required for private connection."
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "blob",
            ]
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.purview_account[0].azurerm_private_endpoint.private_endpoint_purview_account_ingestion_storage_queue[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_purview_account_ingestion_storage_queue" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "ckdmgmt-dev-pview001-ing-queue-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "westus3"
      [32m+[0m[0m name                          = "ckdmgmt-dev-pview001-ing-queue-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "ckdmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = true
          [32m+[0m[0m name                           = "ckdmgmt-dev-pview001-ing-queue-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m request_message                = "Required for private connection."
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "queue",
            ]
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.purview_account[0].azurerm_private_endpoint.private_endpoint_purview_account_platform[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_purview_account_platform" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "ckdmgmt-dev-pview001-platform-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "westus3"
      [32m+[0m[0m name                          = "ckdmgmt-dev-pview001-platform-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "ckdmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "ckdmgmt-dev-pview001-platform-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "platform",
            ]
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.purview_account[0].time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "30s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.synapse_private_link_hub.azurerm_private_endpoint.private_endpoint_synapse_private_link_hub_web[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_synapse_private_link_hub_web" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "ckdmgmtdevsynplh001-web-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "westus3"
      [32m+[0m[0m name                          = "ckdmgmtdevsynplh001-web-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "ckdmgmt-dev-connectivity-syn-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "ckdmgmtdevsynplh001-web-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "web",
            ]
        }
    }

[1m  # module.data_management_zone.module.datamanagement.module.synapse_private_link_hub.azurerm_synapse_private_link_hub.synapse_private_link_hub[0m will be created
[0m  [32m+[0m[0m resource "azurerm_synapse_private_link_hub" "synapse_private_link_hub" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "westus3"
      [32m+[0m[0m name                = "ckdmgmtdevsynplh001"
      [32m+[0m[0m resource_group_name = "ckdmgmt-dev-connectivity-syn-rg"
    }

[1m  # module.data_management_zone.module.datamanagement.module.synapse_private_link_hub.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "30s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_management_zone.module.datamanagement.module.user_assigned_identity.azurerm_user_assigned_identity.user_assigned_identity[0m will be created
[0m  [32m+[0m[0m resource "azurerm_user_assigned_identity" "user_assigned_identity" {
      [32m+[0m[0m client_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "westus3"
      [32m+[0m[0m name                = "ckdmgmt-dev-uai001"
      [32m+[0m[0m principal_id        = (known after apply)
      [32m+[0m[0m resource_group_name = "ckdmgmt-dev-automation-rg"
      [32m+[0m[0m tenant_id           = (known after apply)
    }

[1mPlan:[0m 58 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>